{
  "welcome": "Welcome 1",
  "description": "This is the homepage",
  "home": "Home",
  "about": "About",
  "technologies": "Technologies",
  "experience": "Experience",
  "contact": "Contact",
  "hi": "Hi",
  "option": "Option",
  "portfolio_description": "Skilled Front-End Developer with over 3 years of experience building high- performance web apps. Proficient in JavaScript, React, NextJS, and modern front-end technologies. Expert in creating responsive, accessible, and user-friendly interfaces, with a focus on best practices, performance optimization, and teamwork to deliver scalable solutions. Additionally experienced in developing APIs with ExpressJS, Django, and Flask.",
  "and_i_am_a": "And I am a",
  "download_cv": "Download CV",
  "im_steve_nguyen": "I'm Steve Nguyen",
  "about_me": "About me",
  "portfolio_about_description_1": "I am a Full Stack Developer with a strong focus on building scalable, high-performance web applications.",
  "portfolio_about_description_2": "With over three years of professional experience, I specialize in <span>React</span>, <span>TypeScript</span>, and <span>Next.js</span>, among other modern front-end technologies.",
  "portfolio_about_description_3": "My passion lies in creating user-friendly, responsive interfaces that prioritize performance optimization and accessibility.",
  "portfolio_about_description_4": "In my most recent role as a Front-end Developer, I led the development of several large-scale projects, utilizing modern technologies like <span>ReactJS</span>, <span>Ant Design</span>, <span>Redux</span>, and <span>Tailwind CSS</span>.",
  "portfolio_about_description_5": "I have experience as a mentor, providing guidance on web development topics and helping students build a strong foundation in technologies such as <span>HTML5</span>, <span>CSS3</span>, <span>JavaScript</span>, and <span>ReactJS</span>.",
  "contact_me": "Contact me",
  "my_technologies": "My Technologies",
  "other_technologies": "Other Technologies",
  "fullname": "Fullname",
  "email": "Email",
  "message": "Message",
  "send": "Send",
  "enter_your_value": "Enter your {{value}}",
  "thanks_for_scrolling": "Thanks for scrolling",
  "experience_freshdi_time": "07/2021 - 07/2023, 10/2024 - PRESENT",
  "experience_freshdi_position": "Full stack developer",
  "experience_freshdi_project_1": "Lead the development of scalable web applications using React, MUI, Redux, and TypeScript to build a global marketplace to help buyers and suppliers connect with each other.",
  "experience_freshdi_project_2": "Collaborated closely with UX/UI designers and backend teams to develop user-friendly, responsive, and scalable web applications.",
  "experience_freshdi_project_3": "Optimized the performance of web applications through code splitting, lazy loading, and efficient state management.",
  "experience_freshdi_project_4": "Reviewed code to ensure adherence to best practices and maintain code quality.",
  "experience_freshdi_project_5": "Worked closely with backend teams to integrate APIs, ensuring seamless data flow between frontend and backend services.",
  "experience_freshdi_project_6": "Enhanced the website's SEO through keyword optimization and technical improvements, leading to increased organic traffic and better Google indexing.",

  "experience_phoenixunity_time": "10/2023 - 10/2024",
  "experience_phoenixunity_position": "Front-end developer",
  "experience_phoenixunity_project_1": "Utilized technologies such as ReactJS, Ant Design, Tailwind CSS, Redux, and Next.js across various projects for foreign partners such as Australia and Brazil.",
  "experience_phoenixunity_project_2": "Ensured adherence to coding standards and best practices, fostering a collaborative environment for feedback and improvement, which enhanced code quality, maintainability, and scalability.",
  "experience_phoenixunity_project_3": "Implemented code optimizations by analyzing performance bottlenecks and refactoring critical components, using techniques like code splitting and lazy loading to reduce load times and improve responsiveness, resulting in a smoother user experience and decreased resource consumption.",

  "experience_vtiacademy_time": "07/2023 - 02/2024",
  "experience_vtiacademy_position": "Mentor",
  "experience_vtiacademy_project_1": "Instructor for both basic and advanced web programming courses, covering topics like HTML5, CSS3, JavaScript, and ReactJS.",
  "experience_vtiacademy_project_2": "Provided personalized mentorship, giving students feedback on coding assignments, and guiding them through debugging and problem-solving techniques.",
  "experience_vtiacademy_project_3": "Developed a Node.js server using the ExpressJS framework to provide real-time API services and backend support for the front-end course projects.",

  "experience_uetunited_time": "07/2023 - PRESENT",
  "experience_uetunited_position": "AI Intern",
  "experience_uetunited_project_title": "Adult detection: Web detects images containing banned images",
  "experience_uetunited_project_technologies": "Technologies",
  "experience_uetunited_project_technologies_value": "Pytorch, Convolutional network CNN for training model, Scrapy for crawling data. Flask, Bootstrap, jQuery, Redis for building web application",
  "experience_uetunited_project_responsibilities": "Responsibilities",
  "experience_uetunited_project_responsibilities_value": "Write bot to crawl data, put data into model training and build image recognition web",
  "experience_uetunited_project_team_size": "Team size",
  "experience_uetunited_project_team_size_value": "1",
  "experience_uetunited_project_github": "Github link",
  "experience_uetunited_project_github_value": "<Link href='https://github.com/anhnghia47/Adultdetection'>https://github.com/anhnghia47/Adultdetection</Link>",

  "experience_misa_time": "06/2020 - 08/2020",
  "experience_misa_position": "Front-end Intern",
  "experience_misa_project_title": "Cukcuk: sales management software",
  "experience_misa_project_technologies": "Technologies",
  "experience_misa_project_technologies_value": ".NET, Entity Framework (C#), SQL Server for Back-end and JavaScript, CSS3 for Front-end",
  "experience_misa_project_responsibilities": "Responsibilities",
  "experience_misa_project_responsibilities_value": "Build customer management features interface",
  "experience_misa_project_team_size": "Team size",
  "experience_misa_project_team_size_value": "1"
}
