{
  "welcome": "Chào mừng",
  "description": "Đây là trang chủ",
  "home": "Trang chủ",
  "about": "Giới thiệu",
  "technologies": "Công nghệ",
  "experience": "Kinh nghiệm",
  "contact": "Liên hệ",
  "hi": "Xin chào",
  "option": "Tùy chọn",
  "portfolio_description": "Lập trình viên Front-End có kinh nghiệm hơn 3 năm trong việc xây dựng các ứng dụng web hiệu suất cao. Thành thạo JavaScript, React, NextJS và các công nghệ front-end hiện đại. Chuyên gia trong việc tạo ra các giao diện đáp ứng, dễ truy cập và thân thiện với người dùng, tập trung vào các phương pháp tốt nhất, tối ưu hóa hiệu suất và làm việc nhóm để cung cấp các giải pháp có khả năng mở rộng. Ngoài ra, có kinh nghiệm phát triển APIs với ExpressJS, Django và Flask.",
  "and_i_am_a": "Và tôi là một",
  "download_cv": "Tải CV",
  "im_steve_nguyen": "Tôi là Steve Nguyễn",
  "about_me": "Về tôi",
  "portfolio_about_description_1": "Tôi là một Lập trình viên Full Stack với sự tập trung mạnh mẽ vào việc xây dựng các ứng dụng web có khả năng mở rộng và hiệu suất cao.",
  "portfolio_about_description_2": "Với hơn ba năm kinh nghiệm chuyên môn, tôi chuyên về <span>React</span>, <span>TypeScript</span> và <span>Next.js</span>, cùng nhiều công nghệ front-end hiện đại khác.",
  "portfolio_about_description_3": "Đam mê của tôi là tạo ra những giao diện thân thiện với người dùng, đáp ứng tốt và ưu tiên tối ưu hóa hiệu suất và khả năng tiếp cận.",
  "portfolio_about_description_4": "Trong vai trò gần đây nhất của tôi là Lập trình viên Front-end, tôi đã dẫn dắt phát triển một số dự án quy mô lớn, sử dụng các công nghệ hiện đại như <span>ReactJS</span>, <span>Ant Design</span>, <span>Redux</span> và <span>Tailwind CSS</span>.",
  "portfolio_about_description_5": "Tôi có kinh nghiệm làm mentor, cung cấp hướng dẫn về các chủ đề phát triển web và giúp sinh viên xây dựng nền tảng vững chắc trong các công nghệ như <span>HTML5</span>, <span>CSS3</span>, <span>JavaScript</span> và <span>ReactJS</span>.",
  "contact_me": "Liên hệ tôi",
  "my_technologies": "Công nghệ sử dụng",
  "other_technologies": "Công nghệ khác",
  "fullname": "Họ tên",
  "email": "Email",
  "message": "Lời nhắn",
  "send": "Gửi",
  "enter_your_value": "Nhập {{value}} của bạn",
  "thanks_for_scrolling": "Cảm ơn các bạn đã đọc",
  "experience_freshdi_time": "07/2021 - 07/2023, 10/2024 - HIỆN TẠI",
  "experience_freshdi_position": "Lập trình viên Full stack",
  "experience_freshdi_project_1": "Dẫn dắt phát triển các ứng dụng web có khả năng mở rộng bằng React, MUI, Redux và TypeScript để xây dựng một thị trường toàn cầu giúp người mua và nhà cung cấp kết nối với nhau.",
  "experience_freshdi_project_2": "Hợp tác chặt chẽ với các nhà thiết kế UX/UI và nhóm backend để phát triển các ứng dụng web thân thiện với người dùng, phản hồi nhanh và có khả năng mở rộng.",
  "experience_freshdi_project_3": "Tối ưu hóa hiệu suất của các ứng dụng web thông qua phân tách mã, tải lười và quản lý trạng thái hiệu quả.",
  "experience_freshdi_project_4": "Xem xét mã để đảm bảo tuân thủ các tiêu chuẩn tốt nhất và duy trì chất lượng mã.",
  "experience_freshdi_project_5": "Làm việc chặt chẽ với các nhóm backend để tích hợp API, đảm bảo luồng dữ liệu liền mạch giữa frontend và backend.",
  "experience_freshdi_project_6": "Nâng cao SEO của trang web thông qua tối ưu hóa từ khóa và cải tiến kỹ thuật, dẫn đến tăng lưu lượng truy cập tự nhiên và cải thiện việc lập chỉ mục Google.",

  "experience_phoenixunity_time": "10/2023 - 10/2024",
  "experience_phoenixunity_position": "Lập trình viên Front-end",
  "experience_phoenixunity_project_1": "Sử dụng các công nghệ như ReactJS, Ant Design, Tailwind CSS, Redux và Next.js trong các dự án khác nhau cho các đối tác nước ngoài như Australia và Brazil.",
  "experience_phoenixunity_project_2": "Đảm bảo tuân thủ các tiêu chuẩn mã hóa và thực hành tốt nhất, tạo ra môi trường hợp tác để nhận phản hồi và cải tiến, từ đó nâng cao chất lượng mã, khả năng bảo trì và khả năng mở rộng.",
  "experience_phoenixunity_project_3": "Thực hiện tối ưu hóa mã bằng cách phân tích các nút thắt hiệu suất và tái cấu trúc các thành phần quan trọng, sử dụng các kỹ thuật như phân tách mã và tải lười để giảm thời gian tải và cải thiện khả năng phản hồi, mang lại trải nghiệm người dùng mượt mà hơn và giảm mức tiêu thụ tài nguyên.",

  "experience_vtiacademy_time": "07/2023 - 02/2024",
  "experience_vtiacademy_position": "Giáo viên hướng dẫn",
  "experience_vtiacademy_project_1": "Giáo viên cho cả khóa học lập trình web cơ bản và nâng cao, bao gồm các chủ đề như HTML5, CSS3, JavaScript và ReactJS.",
  "experience_vtiacademy_project_2": "Cung cấp sự hướng dẫn cá nhân hóa, đưa phản hồi cho sinh viên về bài tập mã hóa và hướng dẫn họ qua quá trình gỡ lỗi và kỹ thuật giải quyết vấn đề.",
  "experience_vtiacademy_project_3": "Phát triển một máy chủ Node.js sử dụng framework ExpressJS để cung cấp dịch vụ API thời gian thực và hỗ trợ backend cho các dự án khóa học front-end.",

  "experience_uetunited_time": "07/2023 - HIỆN TẠI",
  "experience_uetunited_position": "Thực tập sinh AI",
  "experience_uetunited_project_title": "Phát hiện người lớn: Web phát hiện hình ảnh chứa nội dung cấm",
  "experience_uetunited_project_technologies": "Công nghệ",
  "experience_uetunited_project_technologies_value": "Pytorch, Mạng nơ-ron tích chập CNN cho việc đào tạo mô hình, Scrapy để thu thập dữ liệu. Flask, Bootstrap, jQuery, Redis để xây dựng ứng dụng web",
  "experience_uetunited_project_responsibilities": "Trách nhiệm",
  "experience_uetunited_project_responsibilities_value": "Viết bot để thu thập dữ liệu, đưa dữ liệu vào đào tạo mô hình và xây dựng web nhận diện hình ảnh",
  "experience_uetunited_project_team_size": "Kích thước đội",
  "experience_uetunited_project_team_size_value": "1",
  "experience_uetunited_project_github": "Liên kết Github",
  "experience_uetunited_project_github_value": "<Link href='https://github.com/anhnghia47/Adultdetection'>https://github.com/anhnghia47/Adultdetection</Link>",

  "experience_misa_time": "06/2020 - 08/2020",
  "experience_misa_position": "Thực tập sinh Front-end",
  "experience_misa_project_title": "Cukcuk: phần mềm quản lý bán hàng",
  "experience_misa_project_technologies": "Công nghệ",
  "experience_misa_project_technologies_value": ".NET, Entity Framework (C#), SQL Server cho Back-end và JavaScript, CSS3 cho Front-end",
  "experience_misa_project_responsibilities": "Trách nhiệm",
  "experience_misa_project_responsibilities_value": "Xây dựng giao diện tính năng quản lý khách hàng",
  "experience_misa_project_team_size": "Kích thước đội",
  "experience_misa_project_team_size_value": "1"
}
